# GetUnitTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..GetUnitTypeId Method
FormatOptions Class See Also
---
Gets the identifier of the unit used to quantify values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ForgeTypeId GetUnitTypeId()
```

Visual Basic
---
```text
Public Function GetUnitTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetUnitTypeId()
```

# Remarks
Most units, such as square feet or degrees, are formatted as decimal decimal numbers. Other units may be displayed with specialized formatting methods like "feet and fractional inches" or "degrees, minutes and seconds".
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
Autodesk.Revit.DB Namespace